{
  "name": "angular-payments",
  "version": "0.0.0",
  "homepage": "https://github.com/laurihy/angular-payments",
  "authors": [
    "Lauri Hynynen <@laurihy>"
  ],
  "main": "lib/angular-payments.js",
  "description": "Directive for formatting and validating credit card forms",
  "keywords": [
    "stripe",
    "stripe.js",
    "stripejs",
    "stripe-angular",
    "stripeAngular",
    "angular-payments",
    "angularPayments"
  ],
  "license": "MIT",
  "ignore": [
    "**/.*",
    "node_modules",
    "bower_components",
    "test",
    "tests"
  ],
  "gitHead": "2472bc9befa256780d106a8e53a9dea12b7341ed",
  "readme": "# Angular Payments\n\nAn Angular Module that provides directives for *formatting* and *validating* forms related to payments. Also, it ships with a directive that makes it easy to integrate with Stripe's wonderful stripe.js.\n\n### Credits\n\nThis library wasn't just heavily inspired by Stripe's jQuery.payments, but is in fact mostly just a port of it to a more AngularJS-oriented style.\n\nAlso, stripeForm is pretty much directly from gtramontina's Stripe Angular: https://github.com/gtramontina/stripe-angular\n\nAll I did was port and combine these great libraries. Cheers!\n\n### Stripe Dependency\n\nAngular Payments includes a directive `stripe-form` which depends on the\n[stripe library](https://stripe.com/docs/stripe.js).\n\nThe stripe library is not necessary to use the other directives.\n\nBe sure to also configure Stripe by setting your publishable key, something like:\n\n```html\n<script type=\"text/javascript\" src=\"https://js.stripe.com/v2/\"></script>\n<script>\n  Stripe.setPublishableKey('YOUR_PUBLISHABLE_KEY');\n</script>\n```\n\n\n## Usage\n\nTo use Angular Payments, add angularPayments as a dependency to your AngularJS module or app.\n\nIf you are using `stripe-form`, follow the instructions above on including\nstripe. \n\nThe module ships 3 directives, all of which should be added as attributes to elements. \n\n* paymentsValidate\n* paymentsFormat\n* stripeFormat\n\n### paymentsValidate\n\nIs used for validating fields on the client side. Usage:\n\n```html\n\t<input type=\"text\" ng-model=\"blah\" payments-validate=\"VALIDATION_TYPE\" />\n```\n\nFor validation to work, element must have an associated ng-model -value.\n\nPossible validation types are:\n\n\n#### card\n\n```html\n\t<input type=\"text\" ng-model=\"number\" payments-validate=\"card\" />\n```\n\t\nCard validation also uses an extra attribute \"payments-type-model\". This attribute defines a model on the scope where the card type will be set as the field recognizes the type from the number.\n\n```html\n\t<input type=\"text\" ng-model=\"number\" payments-validate=\"card\" payments-type-model=\"type\"/>\n```\n\t\nIn this case $scope.number will have the card number from the field and $scope.type will have the credit card type.\n\nThe card validator will also place a $card object on the on the input control as the card type is recognized.  This card object has a number of different fields.  It's easiest to get to this object if both the form and the input have a name, in which case you can access the card object at $scope.formName.inputName.$card.\n\n#### expiry\n\n```html\n\t<input type=\"text\" ng-model=\"expiry\" payments-validate=\"expiry\" />\n```\n\nExpiry actually matches, that a string with format mm / yy[yy] is a valid and non-expired date. It's pretty cool when combined with matching formatting. Again, ported from jQuery.payments.\n\n#### cvc\n\n```html\n\t<input type=\"text\" ng-model=\"cvc\" payments-validate=\"cvc\" />\n```\n\t\nCVC validation also uses an extra attribute \"payments-type-model\". This attribute defines a model on the scope where the CVC will load the card type in order to validate CVC rules based on the card.  This attribute is meant to be used in conjunction with the same attribute on the card validation.\n\n```html\n\t<input type=\"text\" ng-model=\"cvc\" payments-validate=\"cvc\" payments-type-model=\"type\"/>\t\n```\n\nIn this case the CVC field will change its validation rules when $scope.type changes.  For example, a 'visa' type will require 3 digits, but an 'amex' type will allow 3 or 4.\n\n### paymentsFormat\n\nIs used for formatting fields.\n\n```html\n\t<input type=\"text\" payments-format=\"FORMATTING_TYPE\" />\n```\n\t\nFor formatting to work, element must have an associated ng-model -value.\n\nPossible formats:\n\n#### card\n\n```html\n\t<input type=\"text\" payments-format=\"card\" />\n```\n\n- After every 4th character a space (\" \") character is added\n- Maximum 16 characters (excluding those spaces)\n- Only digits\n\n#### Expiry\n\n```html\n\t<input type=\"text\" payments-format=\"expiry\" />\n```\n\n- Essentially \"mm / yyyy\"\n- After two digits for months, insert slash (\"/\")\n- Accept only digits and at most 6 of them (excluding the slash)\n\n#### cvc\n\n\t<input type=\"text\" payments-format=\"cvc\" />\n\n- Limit to 4 digits\n- *Could also be used to match with card type, but this is not implemented yet.*\n\n### stripeForm\n\nIntercepts form-submission, obtains stripeToken and then fires a callback. Essentially abstracts away what you would do manually when following instructions at https://stripe.com/docs/stripe.js\n\n\t<form stripe-form=\"CALLBACK\"> \n\t...\n\t</form>\n\nInstead of sending the form and annotating it with data-stripe -attributes, you should use form's scope, i.e. attach values to form field's using ng-model. Values that are in the scope and that match to values that Stripe accepts, are sent. So if in addition to the formattable and validateable fields you want to send `address_state`, just add `<input type=\"text\" ng-model=\"addressState\" />` to your form.\n\n**Important:** expiry makes a small exception. If you haven't explicitly defined `$scope.expMonth` and `$scope.expYear`, we take `$scope.expiry` and parse it into a month and year assuming mm / yy[yy] format that is produced by `payments-format=\"expiry\"`.\n\nWhen Stripe responds, it passes results to a callback function, which could be:\n\n```javascript\n$scope.handleStripe = function(status, response){\n  if(response.error) {\n    // there was an error. Fix it.\n  } else {\n    // got stripe token, now charge it or smt\n    token = response.id\n  }\n}\n```\n\nAnd then:\n\n```html\n\t<form stripe-form=\"handleStripe\">\n\t...\n```\n\nBasically the directive sends the credit card details directly to stripe, which then returns a token that you can use to charge the card, subscribe a user or to do other things. This ensures that the card details themselves never hit your backend and thus you have to worry a little bit less.\n\n\n## Example\n\nSee example-folder. You can run the example with\n\n\tgrunt connect\n\t\nthen connect to it at http://localhost:8000/example/index.html\n\n\n## Contributors\n\nPlease Edit files in `src/`-folder and before submitting pull request, run grunt to compile and minify files in `lib`-folder.\n\nDespite of slow response times, all patches, bugfixes and features are more and welcome and much appreciated. Thanks to all who have and will contribute! :)\n\n## License \n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to\nthe following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\n\n\n",
  "readmeFilename": "README.md",
  "_id": "angular-payments@0.1.0",
  "commit": "2472bc9befa256780d106a8e53a9dea12b7341ed",
  "repository": {
    "type": "git",
    "url": "git://github.com/laurihy/angular-payments.git"
  }
}